#include<stdio.h>

int main() {
    float a = 0.617; // ประกาศตัวแปร a เป็น float และกำหนดค่าเริ่มต้นเป็น 0.617
    int b = 25; // ประกาศตัวแปร b เป็น int และกำหนดค่าเริ่มต้นเป็น 25
    float c = 19; // ประกาศตัวแปร c เป็น float และกำหนดค่าเริ่มต้นเป็น 19
    int d = 9; // ประกาศตัวแปร d เป็น int และกำหนดค่าเริ่มต้นเป็น 9
    float e = 124.555; // ประกาศตัวแปร e เป็น float และกำหนดค่าเริ่มต้นเป็น 124.555
    float f = 0.001; // ประกาศตัวแปร f เป็น float และกำหนดค่าเริ่มต้นเป็น 0.001

    printf("a=%6.3f%%\n", a); // %6.3f แสดงทศนิยม 3 ตำแหน่ง และมีความกว้าง 6 ตำแหน่ง
    printf("b=%4d%%\n", b);  // %4d แสดงจำนวนเต็ม 4 ตำแหน่ง  
    printf("c =%6.3f%%\n", c); // %6.3f แสดงทศนิยม 3 ตำแหน่ง และมีความกว้าง 6 ตำแหน่ง
    printf("d  =%-2d%%\n", d);  // %-2d แสดงจำนวนเต็ม 2 ตำแหน่ง โดยจัดชิดซ้าย
    printf("e=%7.3f%%\n", e); // %7.3f แสดงทศนิยม 3 ตำแหน่ง และมีความกว้าง 7 ตำแหน่ง
    printf("f=%5.3f%%\n", f); // %5.3f แสดงทศนิยม 3 ตำแหน่ง และมีความกว้าง 5 ตำแหน่ง
}