#include <stdio.h>

int main() {
char name[3]; // char ชื่อของแต่ละคน
int age[3]; // int อายุของแต่ละคน
float height[3]; // float ส่วนสูง (ทศนิยม 1 ตำแหน่ง) ของแต่ละคน
float weight[3]; // float น้ำหนัก (ทศนิยม 1 ตำแหน่ง) ของแต่ละคน
char grade[3]; // char เกรด (ตัวอักษร) ของแต่ละคน

for (int i = 0; i < 3; i++) {  //for คือ การทำซ้ำ 3 ครั้ง
printf("Enter information %d (name age height weight grade): ", i + 1); // แสดงข้อความให้ป้อนข้อมูลของคนที่ i + 1

scanf(" %c %d %f %f %c", &name[i], &age[i], &height[i], &weight[i], &grade[i]); //รับค่า %c ชื่อ, %d อายุ, %f ส่วนสูง, %f น้ำหนัก, %c เกรด
}

printf("\n+-------+-----+------------+-----------+-------------+\n"); // แสดงเส้นแบ่งตาราง
printf("| %-5s | %-3s | %-10s | %-9s| %-11s |\n", // แสดงหัวตาราง ชื่อ, อายุ, ส่วนสูง, น้ำหนัก, เกรด
"Name", "Age", "Height(cm)", "Weight(kg)", "Grade Code"); // แสดงหัวตาราง Name, Age, Height, Weight, Grade
printf("+-------+-----+------------+-----------+-------------+\n"); // แสดงเส้นแบ่งตาราง

for (int i = 0; i < 3; i++) { //วนลูปเพื่อแสดงข้อมูลของแต่ละคน
printf("| %-5c | %3d | %10.1f | %9.1f | %11c |\n", /*แสดงข้อมูลของแต่ละคน %-5c ชื่อ, %3d อายุ, %10.1f ส่วนสูง (ทศนิยม 1 ตำแหน่ง)
,%9.1f น้ำหนัก (ทศนิยม 1 ตำแหน่ง), %11c เกรด*/
name[i], age[i], height[i], weight[i], grade[i]); // %c แสดงตัวอักษร, %d แสดงจำนวนเต็ม, %.1f แสดงทศนิยม 1 ตำแหน่ง
}

printf("+-------+-----+------------+-----------+-------------+\n"); // แสดงเส้นแบ่งตาราง

return 0;
}